# SkyColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GradientBackgroundSettings..::..SkyColor Property
GradientBackgroundSettings Class See Also
---
The color of the top of the sky.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color SkyColor { get; set; }
```

Visual Basic
---
```text
Public Property SkyColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ SkyColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace